Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/iLLD/TC3xx/Tricore/_PinMap/TC38x/IfxAsclin_PinMap_TC38x_LFBGA292.h
IFX_EXTERN IfxAsclin_Tx_Out IfxAsclin8_TX_P02_9_OUT;  /**< \brief Transmit output */
IFX_EXTERN IfxAsclin_Tx_Out IfxAsclin8_TX_P33_7_OUT;  /**< \brief Transmit output */
IFX_EXTERN IfxAsclin_Tx_Out IfxAsclin8_TX_P34_5_OUT;  /**< \brief Transmit output */
IFX_EXTERN IfxAsclin_Tx_Out IfxAsclin9_TX_P01_7_OUT;  /**< \brief Transmit output */
IFX_EXTERN IfxAsclin_Tx_Out IfxAsclin9_TX_P14_7_OUT;  /**< \brief Transmit output */
IFX_EXTERN IfxAsclin_Tx_Out IfxAsclin9_TX_P20_7_OUT;  /**< \brief Transmit output */

/** \brief Table dimensions */
#define IFXASCLIN_PINMAP_NUM_MODULES 24
#define IFXASCLIN_PINMAP_CTS_IN_NUM_ITEMS 2
#define IFXASCLIN_PINMAP_RTS_OUT_NUM_ITEMS 2
#define IFXASCLIN_PINMAP_RX_IN_NUM_ITEMS 7
#define IFXASCLIN_PINMAP_SCLK_OUT_NUM_ITEMS 11
#define IFXASCLIN_PINMAP_SLSO_OUT_NUM_ITEMS 6
#define IFXASCLIN_PINMAP_TX_OUT_NUM_ITEMS 13


/** \brief IfxAsclin_Cts_In table */
IFX_EXTERN const IfxAsclin_Cts_In *IfxAsclin_Cts_In_pinTable[IFXASCLIN_PINMAP_NUM_MODULES][IFXASCLIN_PINMAP_CTS_IN_NUM_ITEMS];

/** \brief IfxAsclin_Rts_Out table */
IFX_EXTERN const IfxAsclin_Rts_Out *IfxAsclin_Rts_Out_pinTable[IFXASCLIN_PINMAP_NUM_MODULES][IFXASCLIN_PINMAP_RTS_OUT_NUM_ITEMS];

/** \brief IfxAsclin_Rx_In table */
IFX_EXTERN const IfxAsclin_Rx_In *IfxAsclin_Rx_In_pinTable[IFXASCLIN_PINMAP_NUM_MODULES][IFXASCLIN_PINMAP_RX_IN_NUM_ITEMS];

/** \brief IfxAsclin_Sclk_Out table */
IFX_EXTERN const IfxAsclin_Sclk_Out *IfxAsclin_Sclk_Out_pinTable[IFXASCLIN_PINMAP_NUM_MODULES][IFXASCLIN_PINMAP_SCLK_OUT_NUM_ITEMS];

/** \brief IfxAsclin_Slso_Out table */
IFX_EXTERN const IfxAsclin_Slso_Out *IfxAsclin_Slso_Out_pinTable[IFXASCLIN_PINMAP_NUM_MODULES][IFXASCLIN_PINMAP_SLSO_OUT_NUM_ITEMS];

/** \brief IfxAsclin_Tx_Out table */
IFX_EXTERN const IfxAsclin_Tx_Out *IfxAsclin_Tx_Out_pinTable[IFXASCLIN_PINMAP_NUM_MODULES][IFXASCLIN_PINMAP_TX_OUT_NUM_ITEMS];

/** \} */

#endif /* IFXASCLIN_PINMAP_TC38X_LFBGA292_H */
